# 0.1 Importing libraries

In [8]:
#Import libraries
import pandas as pd
import numpy as np
import os

# 0.2 Importing data files

In [9]:
#Setting path
path = r'C:\Users\skhra\DataAnalytics\Feb2025_InstacartBasketAnalysis'

In [10]:
#Importing modified orders.csv 
df_ord = pd.read_csv(os.path.join(path, '02- Data', 'PreparedData', 'orders_wrangled.csv'), index_col = 0)

In [11]:
#Importing products.csv
df_prod = pd.read_csv(os.path.join(path, '02- Data', 'OriginalData', 'products.csv'), index_col = False)

In [12]:
df_ord.head(5)

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_from_previous_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [13]:
df_prod.head(5)

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [14]:
df_ord.describe()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_from_previous_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

At first glance, no obvious data defects are present. Min and max values do not suggest any anomaly at first.

# 0.3 Mixed Types

In [15]:
#Checking for mixed types
for col in df_prod.columns.tolist():
    weird = (df_prod[[col]].map(type) != df_prod[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_prod[weird])>0:
        print(col)

product_name

In [16]:
#Checking for mixed types
for col in df_ord.columns.tolist():
    weird = (df_ord[[col]].map(type) != df_ord[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_ord[weird])>0:
        print(col)

df_ord has no mixed types; df_prod has mixed types in product_name. The reason is apparently missing values, see below.

# 0.4 Missing values

In [17]:
#Looking for missing data in prod dataset
df_prod.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [18]:
df_missing1 = df_prod[df_prod['product_name'].isnull()]

In [19]:
df_missing1

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [20]:
df_prod_clean = df_prod[df_prod['product_name'].isnull()==False]

In [21]:
df_prod_clean.shape

(49677, 5)

In [22]:
#Looking for missing data in ord dataset
df_ord.isnull().sum()

order_id                         0
user_id                          0
order_number                     0
order_day_of_week                0
order_hour_of_day                0
days_from_previous_order    206209
dtype: int64

The df_ord data se has no missing values!

# 0.5 Duplicate values

In [23]:
#Looking for duplicate values in df_prod
df_prod_dupl = df_prod_clean[df_prod_clean.duplicated()]

In [24]:
df_prod_dupl

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [25]:
df_prod_clean_nodupl = df_prod_clean.drop_duplicates()

In [26]:
df_prod_clean_nodupl.shape

(49672, 5)

In [27]:
#Looking for duplicate values in df_ord
df_ord_dupl = df_ord[df_ord.duplicated()]

In [28]:
df_ord_dupl

Empty DataFrame
Columns: [order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_from_previous_order]
Index: []

There are no duplicated values in df_ord!

# 0.6 Exporting cleaned datasets

In [29]:
#Exporting df_prod dataset
df_prod_clean_nodupl.to_csv(os.path.join(path, '02- Data', 'PreparedData', 'products_prepared.csv'))

In [30]:
#Exporting df_ord dataset
df_ord.to_csv(os.path.join(path, '02- Data', 'PreparedData', 'orders_prepared.csv'))

In [31]:
df_ord1 = pd.read_csv(os.path.join(path, '02- Data', 'PreparedData', 'orders_prepared.csv'), index_col = 0)

In [33]:
df_ord1.head(5)

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_from_previous_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [35]:
df_prod1 = pd.read_csv(os.path.join(path, '02- Data', 'PreparedData', 'products_prepared.csv'), index_col = 0)

In [36]:
df_prod1.head(5)

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3